from state import Ball

# =============================================================================
# 1. СВОЙСТВА ШАРОВ
# =============================================================================
# МАТЕРИАЛ ПЕРВОГО ШАРА
# Фенолформальдегидная смола (бакелит) -- материал настоящих бильярдных шаров
#
# МАТЕРИАЛ ВТОРОГО ШАРА
# Фенолформальдегидная смола (бакелит) -- материал настоящих бильярдных шаров

FIRST_BALL = Ball(
    position = (0.0, 0.0),
    velocity = (1.0, 0.0),
    radius = 28.5e-3,
    density = 1.75e3,
    young_modulus = 4.0e9,
    poisson_ratio = 0.35,
)

SECOND_BALL = Ball(
    position = (0.12125, 0.035625),
    velocity = (0.0, 0.0),
    radius = 42.75e-3,
    density = 1.75e3,
    young_modulus = 4.0e9,
    poisson_ratio = 0.35,
)

# =============================================================================
# 2. ЗАКОН КОНТАКТНОЙ СИЛЫ
# =============================================================================
# Используется закон Герца

HERTZ_EXPONENT = 1.5


# =============================================================================
# 3. ЧИСЛЕННАЯ СХЕМА
# =============================================================================

SOLVER_METHOD = "DOP853"
SOLVER_RTOL = 1e-10
SOLVER_ATOL = 1e-12
MIN_SEPARATION = 1e-15
MIN_RELATIVE_SPEED = 1e-12
